src/AccumulationRegisters/Scan_ДвиженияКомплектующих/Scan_ДвиженияКомплектующих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Scan_ДвиженияКомплектующих</name>
  <comment>Движения комплектующих (scania)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплектующие</name>
    <type>
      <types>CatalogRef.Scan_Комплектующие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаКомплектующие</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаКомплектующие</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Scan_ДвиженияКомплектующих/ManagerModule.bsl
//rarus tenkam 04.11.2017 mantis 11952 +++
Функция ПолучитьКоличествоПоступления(Склад, Изделие, Комплектующие, ЗаявкаНаКомплектующие, Регистратор = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Scan_ДвиженияКомплектующих.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.Scan_ДвиженияКомплектующих КАК Scan_ДвиженияКомплектующих
		|ГДЕ
		|	Scan_ДвиженияКомплектующих.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И Scan_ДвиженияКомплектующих.Склад = &Склад
		|	И Scan_ДвиженияКомплектующих.Изделие = &Изделие
		|	И Scan_ДвиженияКомплектующих.Комплектующие = &Комплектующие
		|	И Scan_ДвиженияКомплектующих.ЗаявкаНаКомплектующие = &ЗаявкаНаКомплектующие
		|	//ИсключитьРегистратор";
	
	Запрос.УстановитьПараметр("ЗаявкаНаКомплектующие", ЗаявкаНаКомплектующие);
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.УстановитьПараметр("Комплектующие", Комплектующие);
	Запрос.УстановитьПараметр("Склад", Склад);
	Если ЗначениеЗаполнено(Регистратор) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ИсключитьРегистратор", "И Scan_ДвиженияКомплектующих.Регистратор <> &Регистратор");
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Количество) Тогда
			Возврат ВыборкаДетальныеЗаписи.Количество;
		Иначе 
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьКоличествоСписания(Склад, Изделие, Комплектующие, ЗаявкаНаКомплектующие ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Scan_ДвиженияКомплектующих.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.Scan_ДвиженияКомплектующих КАК Scan_ДвиженияКомплектующих
		|ГДЕ
		|	Scan_ДвиженияКомплектующих.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И Scan_ДвиженияКомплектующих.Склад = &Склад
		|	И Scan_ДвиженияКомплектующих.Изделие = &Изделие
		|	И Scan_ДвиженияКомплектующих.Комплектующие = &Комплектующие
		|	И Scan_ДвиженияКомплектующих.ЗаявкаНаКомплектующие = &ЗаявкаНаКомплектующие
		|	//ИсключитьРегистратор";
	
	Запрос.УстановитьПараметр("ЗаявкаНаКомплектующие", ЗаявкаНаКомплектующие);
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.УстановитьПараметр("Комплектующие", Комплектующие);
	Запрос.УстановитьПараметр("Склад", Склад);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Количество) Тогда
			Возврат ВыборкаДетальныеЗаписи.Количество;
		Иначе 
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

//13.02.2018 +++
Функция ПолучитьКоличествоОстаток(Склад, Изделие, Комплектующие, ЗаявкаНаКомплектующие) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ДвиженияКомплектующихОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Scan_ДвиженияКомплектующих.Остатки КАК Scan_ДвиженияКомплектующихОстатки
		|ГДЕ
		|	Scan_ДвиженияКомплектующихОстатки.Склад = &Склад
		|	И Scan_ДвиженияКомплектующихОстатки.Изделие = &Изделие
		|	И Scan_ДвиженияКомплектующихОстатки.Комплектующие = &Комплектующие
		|	И Scan_ДвиженияКомплектующихОстатки.ЗаявкаНаКомплектующие = &ЗаявкаНаКомплектующие";
	
	Запрос.УстановитьПараметр("ЗаявкаНаКомплектующие", ЗаявкаНаКомплектующие);
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.УстановитьПараметр("Комплектующие", Комплектующие);
	Запрос.УстановитьПараметр("Склад", Склад);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КоличествоОстаток) Тогда
			Возврат ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Иначе 
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
//13.02.2018 ---

//rarus tenkam 04.11.2017 mantis 11952 ---
